## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account.logs[0] has changed
  ~ resource "azurerm_storage_account" "logs" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Storage/storageAccounts/findatppr397logs"
        name                              = "findatppr397logs"
        tags                              = {
            "Environment"      = "pr-397"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (37 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "20.57.77.148",
              + "40.77.93.43",
                # (1 unchanged element hidden)
            ]
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-397applogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["http"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-397httplogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_function_app.default will be updated in-place
  ~ resource "azurerm_linux_function_app" "default" {
      ~ app_settings                      = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"          = (sensitive value)
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"   = (sensitive value)
            # (7 unchanged elements hidden)
        }
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Web/sites/find-a-tp-pr-397-fa"
        name                              = "find-a-tp-pr-397-fa"
      ~ tags                              = {
            "Environment"                                    = "pr-397"
            "Product"                                        = "National Tutoring Programme"
            "Service Offering"                               = "National Tutoring Programme"
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=a62f6f74-0834-4b9a-a044-ad11b2332bef;IngestionEndpoint=https://westeurope-5.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/" -> null
          - "hidden-link: /app-insights-instrumentation-key" = "a62f6f74-0834-4b9a-a044-ad11b2332bef" -> null
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/microsoft.insights/components/find-a-tp-pr-397-insights-fa" -> null
        }
        # (24 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string  = (sensitive value) -> null
          - application_insights_key                = (sensitive value) -> null
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_web_app.default[0] will be updated in-place
  ~ resource "azurerm_linux_web_app" "default" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Web/sites/find-a-tp-pr-397"
        name                              = "find-a-tp-pr-397"
        tags                              = {
            "Environment"      = "pr-397"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (19 unchanged attributes hidden)

      ~ logs {
            # (2 unchanged attributes hidden)

          ~ application_logs {
                # (1 unchanged attribute hidden)

              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (2 unchanged attributes hidden)
                }
            }

          ~ http_logs {
              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_key_vault[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "default_key_vault" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-397-kv|find-a-tp-pr-397-default-kv-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-397-default-kv-diag"
        # (2 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_redis_cache[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "default_redis_cache" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Cache/redis/find-a-tp-pr-397-redis-cache|find-a-tp-pr-397-default-redis-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-397-default-redis-diag"
        # (2 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.function_app[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "function_app" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Storage/storageAccounts/findatppr397falogs|find-a-tp-pr-397-storage-diag-fa"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-397-storage-diag-fa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.web_app[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "web_app" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Storage/storageAccounts/findatppr397logs|find-a-tp-pr-397-storage-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-397-storage-diag"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.webhook[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "webhook" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Logic/workflows/find-a-tp-pr-397-webhook-workflow|find-a-tp-pr-397-webhook-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-397-webhook-diag"
        # (2 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_scheduled_query_rules_alert.data_extraction_fa_error_alert[0] will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert" "data_extraction_fa_error_alert" {
      + auto_mitigation_enabled = true
      + data_source_id          = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Insights/components/find-a-tp-pr-397-insights-fa"
      + description             = "This rule triggers when the function DataExtraction has encountered an error in a FaTP environment."
      + enabled                 = true
      + frequency               = 5
      + id                      = (known after apply)
      + location                = "westeurope"
      + name                    = "find-a-tp-pr-397-fa-data-extraction-errors"
      + query                   = <<-EOT
            requests
            | project
              timestamp,
              id,
              operation_Name,
              success,
              resultCode,
              duration,
              operation_Id,
              cloud_RoleName,
              invocationId=customDimensions['InvocationId']
            | where timestamp > ago(1d)
            | where operation_Name =~ 'DataExtraction'
            | where success == false
            | order by timestamp desc
            | take 1
        EOT
      + query_type              = "ResultCount"
      + resource_group_name     = "s177d01-ntp-pr-397"
      + severity                = 0
      + tags                    = {
          + "Environment"      = "pr-397"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + time_window             = 6

      + action {
          + action_group = [
              + "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Insights/actionGroups/find-a-tp-pr-397-actiongroup",
            ]
        }

      + trigger {
          + operator  = "Equal"
          + threshold = 1
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_scheduled_query_rules_alert.email_processing_fa_error_alert[0] will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert" "email_processing_fa_error_alert" {
      + auto_mitigation_enabled = true
      + data_source_id          = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Insights/components/find-a-tp-pr-397-insights-fa"
      + description             = "This rule triggers when the function PollEmailProcessing has encountered an error in a FaTP environment."
      + enabled                 = true
      + frequency               = 5
      + id                      = (known after apply)
      + location                = "westeurope"
      + name                    = "find-a-tp-pr-397-fa-data-extraction-errors"
      + query                   = <<-EOT
            requests
            | project
              timestamp,
              id,
              operation_Name,
              success,
              resultCode,
              duration,
              operation_Id,
              cloud_RoleName,
              invocationId=customDimensions['InvocationId']
            | where timestamp > ago(2m)
            | where operation_Name =~ 'PollEmailProcessing'
            | where success == false
            | order by timestamp desc
            | take 1
        EOT
      + query_type              = "ResultCount"
      + resource_group_name     = "s177d01-ntp-pr-397"
      + severity                = 0
      + tags                    = {
          + "Environment"      = "pr-397"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + time_window             = 6

      + action {
          + action_group = [
              + "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Insights/actionGroups/find-a-tp-pr-397-actiongroup",
            ]
        }

      + trigger {
          + operator  = "Equal"
          + threshold = 1
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_scheduled_query_rules_alert.function_app_error_alert[0] will be destroyed
  # (because azurerm_monitor_scheduled_query_rules_alert.function_app_error_alert is not in configuration)
  - resource "azurerm_monitor_scheduled_query_rules_alert" "function_app_error_alert" {
      - authorized_resource_ids = [] -> null
      - auto_mitigation_enabled = true -> null
      - data_source_id          = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Insights/components/find-a-tp-pr-397-insights-fa" -> null
      - description             = "This rule triggers when a function within the function app has encountered an error in a FaTP environment." -> null
      - enabled                 = true -> null
      - frequency               = 5 -> null
      - id                      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Insights/scheduledQueryRules/find-a-tp-pr-397-faapp-errors" -> null
      - location                = "westeurope" -> null
      - name                    = "find-a-tp-pr-397-faapp-errors" -> null
      - query                   = <<-EOT
            requests
            | project
              timestamp,
              id,
              operation_Name,
              success,
              resultCode,
              duration,
              operation_Id,
              cloud_RoleName,
              invocationId=customDimensions['InvocationId']
            | where timestamp > ago(2m)
            | where success == false
            | order by timestamp desc
            | take 1
        EOT -> null
      - query_type              = "ResultCount" -> null
      - resource_group_name     = "s177d01-ntp-pr-397" -> null
      - severity                = 0 -> null
      - tags                    = {
          - "Environment"      = "pr-397"
          - "Product"          = "National Tutoring Programme"
          - "Service Offering" = "National Tutoring Programme"
        } -> null
      - throttling              = 0 -> null
      - time_window             = 6 -> null

      - action {
          - action_group = [
              - "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Insights/actionGroups/find-a-tp-pr-397-actiongroup",
            ] -> null
        }

      - trigger {
          - operator  = "Equal" -> null
          - threshold = 1 -> null
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_resource_group.default[0] will be updated in-place
  ~ resource "azurerm_resource_group" "default" {
        id       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397"
        name     = "s177d01-ntp-pr-397"
      ~ tags     = {
          ~ "Environment"      = "Dev" -> "pr-397"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (1 unchanged attribute hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account_network_rules.logs[0] will be updated in-place
  ~ resource "azurerm_storage_account_network_rules" "logs" {
        id                         = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Storage/storageAccounts/findatppr397logs"
      ~ ip_rules                   = [
          - "40.77.93.43",
            # (1 unchanged element hidden)
        ]
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 9 to change, 1 to destroy.
```
</details>